<?php
/**
 * Created by PhpStorm.
 * User: 123
 * Date: 2017/8/14
 * Time: 17:22
 */
echo '官网查yii,composer下载，';
//设计到开发
//后台，管理员，会员，商品分类，商品，订单，
//登录、注册、购物车，下单，订单支付
//nginx  lnmp   yii2.0
//composer  linux 编辑器vim


//前台 商品展示功能，用户购买流程
//前台分类，商品数据，注册，登录，也可扣扣登录，点击分类可以查看这个分类下的所有商品，商品图，商品图片列表，库存量，价格，商品详情，加入购物车，
//商品选购信息，数量控制，支付结算，为用户创建订单，支付方式支付宝，支付后查看物流，收获后确认，完成订单流程
//后台数据管理，管理员登录进入后台控制面板，有管理员用户模块，会员模块，商品分类模块，商品模块，的订单模块


//yii2的面向对象编程思想
//layout组件、模板引擎、ActiveForm验证组件，Validation验证组件
//url地址生成组件、Html标签生成组件、Pagination分页组件